In [ ]:
import pandas as pd
import numpy as np

In [201]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                   '12. Air France', '"Swiss Air"']})

In [202]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1

In [203]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 3

In [204]:
df['From_To']=df['From_To'].str.title()
df['From_To']

0        London_Paris
1        Madrid_Milan
2    London_Stockholm
3      Budapest_Paris
4     Brussels_London
Name: From_To, dtype: object

# 2

In [205]:
df[['From','To']]=df.From_To.str.split('_',expand=True)
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,London_Paris,10045,"[23, 47]",KLM(!),London,Paris
1,Madrid_Milan,10055,[],<Air France> (12),Madrid,Milan
2,London_Stockholm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_Paris,10075,[13],12. Air France,Budapest,Paris
4,Brussels_London,10085,"[67, 32]","""Swiss Air""",Brussels,London

# 4

In [206]:
df.drop('From_To',axis=1,inplace=True)

In [207]:
df1=df.copy()

In [208]:
df1

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# 5

In [209]:
df2=pd.DataFrame(df1.RecentDelays.values.tolist())

In [210]:
df2

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [211]:
length_cols=df2.shape[1]
length_cols

3

In [212]:
df2.columns[0]

0

In [213]:
column_list = []
column_dict = {}
for i in range(length_cols):
    key = df2.columns[i]
    value='Delay ' + str(i+1)
    column_dict[key]=value
    
column_dict

{0: 'Delay 1', 1: 'Delay 2', 2: 'Delay 3'}

In [214]:
df2.rename(columns=column_dict,inplace=True)
df2

   Delay 1  Delay 2  Delay 3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [216]:
df[['Delay 1','Delay 2','Delay 3']]=df2[['Delay 1','Delay 2','Delay 3']]

In [217]:
df

,FlightNumber,RecentDelays,Airline,From,To,Delay 1,Delay 2,Delay 3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN